{"key":"en.content.start.fileHandling","value":"<div class=\"headline-main\">File nomenclature, organization and versioning</div>\n\n<div class=\"headline-sub\">Be organized!</div>\n\n<div class=\"body-teaser\">How do you keep track of all files generated during a scientific project? How do you deal with changes that can occur during data processing and analysis, or while editing a text document (e.g. report)?&nbsp;</div>\n\n<div class=\"body-text\">Several people may be involved, it is highly recommended to define practices&nbsp;<em>prior to the start of a project</em>, and observe such practices throughout the research process.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-teaser\">When you (or others from your team) look for a specific file, maybe long after it has been generated, in what terms do you think?&nbsp;</div>\n\n<div class=\"body-text\">It could be, among other things, time period, creator, activity or data collection method (e.g. experiment), geographic location, or document type (e.g. presentation or report). File names should be descriptive, providing useful cues to content of a file independent of its location on a computer &ndash; files may be transferred, and the folder structure context could be lost.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">File nomenclature</div>\n\n<div class=\"body-head-comment\">What is (or could/should be) in a [file] name?</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Some suggested Dos and Don&rsquo;ts for file nomenclature:</div>\n\n<div class=\"body-text\"><strong>Do (Good practice)</strong></div>\n\n<ul>\n\t<li>include relevant information in file names. This may include project, investigator (initials), experiment, location, date, parameter, status of data (raw, processed, &hellip;), file version (see below), or anything else deemed relevant in a given context.</li>\n\t<li>use YYYYMMDD for dates (e.g. 20160802) and put date at the beginning or end of file names, both to facilitate chronological sorting. YYMMDD may suffice, but isn&rsquo;t as self-explanatory/may be ambiguous (160802 could also be 4:08:02PM).</li>\n\t<li>use leading zeros for other numbers as needed (001, 002, &hellip;. 011, &hellip;. 114 rather than 1, 2, &hellip;.. 11, &hellip;.. 114), also to allow files to be properly sorted.</li>\n\t<li>use dashes (file-name.xxx) or underscores (file_name.xxx) to separate parts of a filename.</li>\n\t<li>generate a&nbsp;<strong>Readme file</strong>&nbsp;explaining file nomenclature (including the meaning of acronyms or abbreviations), file organization and versioning. Store this file on top of a folder structure for easy access.</li>\n\t<li><strong>be consistent throughout a project, also when several people are involved.</strong></li>\n</ul>\n\n<div class=\"body-text\"><strong>Don&rsquo;t (Questionable practice)</strong></div>\n\n<ul>\n\t<li>use special characters such as ~ ! / \\ @ # $ % ^ &amp; * ( ) ` ; &lt; &gt; ? , [ ] { } &lsquo; &ldquo;| as they may have specific meanings in certain operating environments. Also avoid &auml; &ouml; &uuml; &szlig; &aring; &oslash; &ntilde; or similar.</li>\n\t<li>use dots . other than before the file extension</li>\n\t<li>use spaces in file names &ndash; they might end up being truncated during file transfer (with the file extension also lost and files potentially becoming unreadable).</li>\n\t<li>make file names overly long (a maximum of 32 or 24 characters is suggested) &ndash; this may involve compromises regarding the first Do criterion</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p><strong>Good example:</strong></p>\n\n<p><strong><span class=\"body-intended green\">20140618_exp08_co2data_proc_v01.csv</span></strong></p>\n\n<p><em>( proc represents &ldquo;processed&rdquo; )</em></p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p><strong>Bad example:</strong></p>\n\n<p><strong><span class=\"body-intended red\">CO2data (exp8) June 18 2014.csv</span></strong></p>\n\n<p>This contains (nearly) the same information, but: when numerous files are sorted, the order will be e.g. exp11 ahead of exp8, August-July-June-March, June 18 2014 ahead of June 27 2013. Sorting by &ldquo;date modified&rdquo; (external to the file name) won&rsquo;t help either if you made even minor changes to some of the files at variable later moments. Spaces and special characters () in the filename might cause problems in certain situations. Are these raw or processed data??</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Very bad example:</strong></div>\n\n<p><strong><span class=\"body-intended red\">DSC_258.jpg</span></strong></p>\n\n<p>This is how an image is saved by a digital camera, but it doesn&rsquo;t reveal anything about the image. File properties may contain some relevant information such as date created and maybe location, but do you want to check this manually for hundreds of images? Changing the filename immediately (or as soon as possible) will save you trouble later on,&nbsp;e.g. Fieldwork_PA_160819_1624.jpg . Make sure that you (and others) will always understand that PA means Pennsylvania, and that 1624 is time (hour and minute, local or GMT &ndash; either may be fine but be consistent) rather than 1624th image on the given day.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"blue body-text info-box\">See also:&nbsp;Stanford Libraries&nbsp;<span class=\"body-link\"><a href=\"https://library.stanford.edu/research/data-management-services/data-best-practices/best-practices-file-naming\" rel=\"noreferrer noopener\" target=\"_blank\">Best Practices for File Naming</a></span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Information above is based on this and other sources. The Stanford pages include a poor and a well-done case study &ndash; the latter requires detailed documentation to be understandable also for people external to the project (and dots in the file names weren&rsquo;t considered problematic).</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">File organization/folder structure</div>\n\n<div class=\"body-text\">This may also require judgement and compromises: a very deep folder structure (subsubsubsubsubfolders) can be as inconvenient as a folder with 100 or more individual files.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Whatever your choice is in the end, it makes sense to define your strategy <strong>early in the research process</strong>. Re-organizing everything halfway during a project, towards its end or close to a deadline can be tedious and time-consuming. Yet working with a sub-optimal file structure for lack of time to implement major changes, or out of inertia, can also be annoying.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>For a Ph.D. thesis</strong>, the folder structure could include e.g. Literature (by others), Publications (own ones), Thesis (Ph.-D. relevant material), Projects (here side projects), Pictures, Experiments (setup and documentation), Data (keep raw data separate from processed data). Experiments and data could be sorted thematically, chronologically, geographically (several fieldwork locations) or in another way, and the folder structure might be flat or deep &ndash; whatever seems to work best in the given case.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">File versioning</div>\n\n<div class=\"body-head-comment\">Track changes over time (and research progress)</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Documents may evolve over time, several people may be involved in sequential changes. For data (of any kind, e.g. numeric or images) and text documents alike, file versioning serves two purposes:</div>\n\n<ul>\n\t<li>You can revert to earlier versions if needed.</li>\n\t<li>You can keep track of changes, including documentation on the underlying rationale and people involved.</li>\n</ul>\n\n<div class=\"body-text\">Versions should be numbered consecutively, distinguishing major changes (v1, v2, v3, &hellip;) from minor ones (v1-1, v1-2, v1-3 or 1a, 1b, 1c). Use leading zeros if you expect more than nine versions. However: Do NOT apply such numbering when using version control software, as it will interfere with automatic versioning.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Qualifiers such as &ldquo;raw&rdquo; or &ldquo;processed&rdquo; for data, or &ldquo;draft&rdquo; or &ldquo;internal&rdquo; for documents are fine. So is &ldquo;final&rdquo; BUT don&rsquo;t use confusing terms such as final2, final-revised, final-changed_again, final_really, &hellip;.. . In other words: Assign &ldquo;final&rdquo; only when you are sure that no further changes will occur. This might be the case after a document has been approved by everyone involved, or was accepted for publication.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">As applicable, versioning should include documentation on</div>\n\n<ul>\n\t<li>What has changed, and why?</li>\n\t<li>How were changes implemented (e.g. data processing steps)?</li>\n\t<li>Who was involved and/or responsible?</li>\n</ul>\n\n<div class=\"body-text\">Such information may be included within documents, and/or provided separately.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">In case of many revisions, in order to keep an overview of major/relevant changes it may be appropriate to discard some of the minor versions, or to store them in a separate (&ldquo;Archive&rdquo;) location. Less relevant versions could e.g. include abandoned data processing steps (flawed or inefficient approaches).</div>\n\n<p>&nbsp;</p>\n"}