{"key":"en.content.start.legalAndEthical","value":"<div class=\"headline-main\">Legal and Ethical Aspects</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\">Some data cannot be freely shared. This section focuses on&nbsp;<strong>personal data&nbsp;and privacy issues</strong>. Other cases might be witness protection, data revealing precise locations of endangered species or vulnerable archaeological sites and data with potential for dual use &ndash; civil and military with possible abuse by terrorists.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Human participants are often willing, sometimes even eager to participate in and thus contribute to scientific research. But they may care about their privacy. <strong>Trust</strong> between researchers and study participants has to be created and needs to be maintained. Study participants may not want their personal data to be (re-)used by others whom they do not trust, and/or for purposes which they do not approve.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">We provide general guidance followed by links to applicable regulations and other resources with more detailed coverage of some topics. <strong>The Max Planck Digital Library does not provide legal advice. Professional legal advice should be sought if you are unsure about legal requirements placed on your (planned) research.</strong></div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">What are Personal Data?</div>\n\n<div class=\"body-text\">Personal data are data that can be<strong> attributed to a specific identifiable person</strong>. These data can consist of the following three categories:</div>\n\n<ul>\n\t<li><strong>Direct identifiers</strong>&nbsp;can be unambiguously linked to a single person, e.g. name, address, phone number, social security number (and similar), email address (if revealing name and possibly employer) but also unique profession (e.g. CEO of a named company), photos (also MRI scans) or voices.</li>\n\t<li><strong>Indirect identifiers</strong>&nbsp;can reveal the identity of a person taken together in the same dataset, and possibly combined with information from other sources. Indirect identifiers include birth date, age, place of residence/zip code, rare profession or income for example.<br />\n\tThe potential for identification is currently much higher than decades ago, because a lot of information is readily and often freely available on the Internet. For studies covering a named small area, local knowledge and personal information about other people also have to be taken into account.</li>\n\t<li><strong>Special personal data</strong>&nbsp;(also referred to as &ldquo;sensitive data&rdquo;): racial/ethnic origin, political opinion, religious or philosophical beliefs, trade union membership, sexual activity and/or orientation, health data, genetic and biometric data.</li>\n</ul>\n\n<p>Direct identifiers should be replaced as soon as possible by <strong>pseudonyms</strong> during the research process (pseudonymization). Special personal data should only be collected if relevant for the given study. Generally,&nbsp;<strong>data minimization</strong>&nbsp;implies that data that aren&rsquo;t needed to answer a study question shouldn&rsquo;t be collected in the first place.</p>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Ethics Approval&nbsp;</div>\n\n<div class=\"body-text\">Some research will require prior approval by a Research Ethics Committee or Institutional Review Board. Many German universities have an ethics committee at the medical faculty/university hospital &ndash; see&nbsp;<span class=\"body-link\"><a href=\"https://www.ak-med-ethik-komm.de/index.php?option=com_content&amp;view=featured&amp;Itemid=101&amp;lang=de\" rel=\"noreferrer noopener\" target=\"_blank\">Arbeitskreis medizinischer Ethik-Kommissionen in der Bundesrepublik Deutschland e.V.</a></span>&nbsp;&ndash; which can also assess research projects by Max Planck researchers. If this option isn&rsquo;t available, the MPG project leader can contact the&nbsp;<span class=\"body-link\"><a href=\"https://max.mpg.de/Ausschuesse-und-Vertretungen/Pages/Ethikrat_EN.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">Ethics Council of the Max Planck Society</a></span> (MPG Intranet) for an ethics vote.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p>Further resources:&nbsp;<a href=\"https://www.dgps.de/index.php?id=185\" rel=\"noreferrer noopener\" target=\"_blank\">Ethikkommission Deutsche Gesellschaft f&uuml;r Psychologie</a>&nbsp;and&nbsp;<a href=\"https://www.dgps.de/index.php?id=ethikraete\" rel=\"noreferrer noopener\" target=\"_blank\">psychological faculties of universities</a>,&nbsp;<a href=\"https://dgfs.de/de/inhalt/ueber/ethikkomission.html\" rel=\"noreferrer noopener\" target=\"_blank\">Ethikkommission Deutsche Gesellschaft f&uuml;r Sprachwissenschaft</a>,&nbsp;<a href=\"https://www.dgfe.de/dgfe-wir-ueber-uns/ethik-rat-ethikkodex\" rel=\"noreferrer noopener\" target=\"_blank\">Ethikkommission Deutsche Gesellschaft f&uuml;r Erziehungswissenschaft</a></p>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Informed Consent</div>\n\n<div class=\"body-text\">Informed consent by study participants and data anonymization are two key aspects for generating, processing and (possibly) sharing data from research on human subjects. <strong>Anonymization</strong> has to be balanced with data utility. If sufficient data anonymization compromises data utility, data may still be shared under restricted access.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Before giving consent, participants of scientific studies have to be informed which personal data will be collected, archived and potentially shared, and which steps will be taken to safeguard anonymity and confidentiality. If special (sensitive) data are collected, this has to be clearly mentioned. <strong>Participant information </strong>should include the project&nbsp;purpose as well as benefits and possible risks for the study participants.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">All documents should be written in a language understandable to participants, and be concise while complete. Participants must have the opportunity to ask questions, and must be provided with contact details for questions that may arise at a later stage.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">If these requirements are met, a participant can make a&nbsp;<strong>voluntary informed choice</strong>&nbsp;to accept or refuse to cooperate. Consent will often be specific, i.e. linked to the stated purpose of a scientific study.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">It must be possible to&nbsp;<strong>withdraw consent</strong>&nbsp;at any later stage, as easily as giving consent and without providing reasons. Participants must be clearly informed&nbsp;that a refusal to participate or later withdrawal of consent will not lead to any consequences.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p>Written or oral consent? Written consent is preferable, as it facilitates documentation and allows clarification of the extent of consent. However, written consent may not be possible in some cases, e.g. informal research settings or participants wary of formal documentation. Oral consent may be acceptable, but should ideally be recorded (video or audio) or be obtained in the presence of a witness.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">So far, it has been assumed that study participants are capable of and legally entitled to giving consent. If this is not the case, consent has to be obtained from parents/guardians (for children) or legal representatives (in case of mental illness or dementia). To the extent possible, participants should still be asked, with assent registered and dissent respected. It also has to be justified why a study needs to include participants unable to provide consent.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Research without consent&nbsp;</strong>may be necessary if participants cannot be informed in advance, because knowledge of the underlying research question would invalidate the method. Such research is possible, but will be subject to rigorous ethical review, ensuring that three criteria are met:</div>\n\n<ol>\n\t<li>clear value and benefit of the research</li>\n\t<li>no alternative research design possible to address the research question</li>\n\t<li>no or very minimal risk of harm to the participant</li>\n</ol>\n\n<div class=\"distance px12\" style=\"text-align:center\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Data Anonymization</div>\n\n<div class=\"body-text\">Anonymization aims at data that can no longer be linked (unambiguously or tentatively) to an individual person, sufficiently anonymized data are no longer considered personal data. <strong>Anonymization is irreversible</strong> and thereby distinct from reversible pseudonymization, where data and personal identifiers are stored separately and can be combined with each other again.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Anonymization techniques</strong>&nbsp;may include</div>\n\n<ul>\n\t<li><strong>removal&nbsp;</strong>of direct identifiers, as well as indirect identifiers.</li>\n\t<li><strong>generalization&nbsp;</strong>of data, providing ranges rather than precise values or not revealing details: e.g. age 20-30, 30-40, 40-50, &hellip; , only first three digits of zip codes, region rather than village.</li>\n\t<li><strong>top-encoding</strong>&nbsp;rare values or outliers: e.g. age 80 or higher, monthly net income 7500 EUR or higher, three or more children, &ldquo;other&rdquo; for rare mother tongue in a given context.</li>\n\t<li><strong>distorting</strong>&nbsp;data by adding some &quot;noise&quot; &ndash; precluding identification of individuals while not affecting statistical analysis and interpretation of data.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Qualitative data</strong>&nbsp;(e.g. interviews and their transcripts) pose additional challenges: Personal identifiers may occur throughout a document rather than in a structured and predictable way, study participants may reveal information about third parties. Such documents need to be carefully edited, names might be replaced by roles (husband, friend, teacher) or by he/she. Modifications should be clearly marked, for example as &quot;names changed&quot;.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Search and replace functions of software can be helpful but should be used with care and manually checked: some replacements might be unnecessary, while other personal identifiers are overlooked (e.g. due to typos). Editing video or audio documents can be technically challenging, but can be realized for example by blurring faces in videos or add bleeping to audio files. In some cases it may be better to share only transcripts.</div>\n\n<div class=\"body-text\">Anonymization is always a <strong>trade-off between removing all potential identifiers and keeping the data</strong> scientifically significant.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><img alt=\"\" src=\"/media/en/content/start/legalAndEthical/Identifiability_spectrum6.webp\" style=\"width:100%\" /></div>\n\n<p style=\"text-align:center\">Source: modified from&nbsp;<a href=\"https://understandingpatientdata.org.uk/what-does-anonymised-mean\" rel=\"noreferrer noopener\" target=\"_blank\">understandingpatientdata.org.uk</a>&nbsp;License&nbsp;<a href=\"https://creativecommons.org/licenses/by/4.0/\" rel=\"noreferrer noopener\" target=\"_blank\">CC BY</a></p>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\">Aggregated data (summary statistics of large datasets not revealing individual data points) offer guaranteed anonymity. But usability of aggregated data may be limited, both in terms of verifying some research conclusions and to address new research questions.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">If there a still concerns about anonymized data it might be a good idea to insist on signing a <strong>data use agreement</strong>. This agreement should specify that users will</div>\n\n<ul>\n\t<li>use such data only for a defined scientific purpose (relevant and consistent with informed consent from study participants).</li>\n\t<li>refrain from attempts to re-identify study participants.</li>\n\t<li>refrain from sharing data with third parties.</li>\n</ul>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<ul>\n</ul>\n\n<div class=\"body-headline\" style=\"text-align:center\">Legal Framework and Guidelines for Biomedical Research</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://gdpr-info.eu/\" rel=\"noreferrer noopener\" target=\"_blank\">General Data Protection Regulation (GDPR)</a></span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://dsgvo-gesetz.de/bdsg/\" rel=\"noreferrer noopener\" target=\"_blank\">Bundesdatenschutzgesetz</a></span>&nbsp;(new version 2018, German implementation of EU regulations)</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://www.wma.net/policies-post/wma-declaration-of-helsinki-ethical-principles-for-medical-research-involving-human-subjects/\" rel=\"noreferrer noopener\" target=\"_blank\">WMA Declaration of Helsinki</a>&nbsp;</span>&ndash; Ethical Principles for Medical Research Involving Human Subjects</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://www.ema.europa.eu/en/ich-e6-r2-good-clinical-practice\" rel=\"noreferrer noopener\" target=\"_blank\">Guideline for Good Clinical Practice</a></span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://cioms.ch/shop/product/international-ethical-guidelines-for-health-related-research-involving-humans/\" rel=\"noreferrer noopener\" target=\"_blank\">International ethical guidelines for health-related research involving humans</a></span>&nbsp;CIOMS (Council for International Organizations of Medical Science)</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://www.coe.int/en/web/bioethics/oviedo-convention\" rel=\"noreferrer noopener\" target=\"_blank\">Oviedo Convention</a></span>: protecting human rights in the biomedical field</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://www.hhs.gov/ohrp/regulations-and-policy/belmont-report/read-the-belmont-report/index.html\" rel=\"noreferrer noopener\" target=\"_blank\">Belmont Report</a></span>: Ethical Principles and Guidelines for the Protection of Human Subjects of Research (U.S. Department of Health and Human Services)</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>See also:&nbsp;</strong>Dankar, F. K., Gergely, M., &amp; Dankar, S. K. (2019). Informed Consent in Biomedical Research. <em>Computational and Structural Biotechnology Journal 17</em>, 463-474.<br />\n<span class=\"body-link\"><a href=\"https://doi.org/10.1016/j.csbj.2019.03.010\" rel=\"noreferrer noopener\" target=\"_blank\">https://doi.org/10.1016/j.csbj.2019.03.010</a>&nbsp;</span><br />\n(Mini Review on historical developments and current practice for Big Data)</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Further Reading</div>\n\n<div class=\"body-text\">CESSDA (Consortium of European Social Science Data Archives)&nbsp;<br />\n<span class=\"body-link\"><a href=\"https://www.cessda.eu/Training/Training-Resources/Library/Data-Management-Expert-Guide/5.-Protect\" rel=\"noreferrer noopener\" target=\"_blank\">Data Management Expert Guide</a></span>&nbsp;&ndash; legal and ethical considerations in creating shareable data</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">UK Data Service &ndash;&nbsp;<span class=\"body-link\"><a href=\"https://www.ukdataservice.ac.uk/manage-data/legal-ethical.aspx\" rel=\"noreferrer noopener\" target=\"_blank\">Legal and ethical issues</a></span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">European Commission&nbsp;<span class=\"body-link\"><a href=\"https://ec.europa.eu/research/participants/data/ref/h2020/grants_manual/hi/ethics/h2020_hi_ethics-data-protection_en.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Ethics and data protection</a></span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Kreutzer, T., &amp; Lahmann, H. (2019)&nbsp;<span class=\"body-link\"><a href=\"https://blogs.sub.uni-hamburg.de/hup/products-page/publikationen/169/\" rel=\"noreferrer noopener\" target=\"_blank\">Rechtsfragen bei Open Science. Ein Leitfaden.</a></span>&nbsp;Hamburg University Press</div>\n"}
