{"key":"en.content.start.sustainabilityFactors","value":"<div class=\"headline-sub\">Sustainability factors for digital file formats (Library of Congress)</div>\n\n<ul>\n\t<li>\n\t<div class=\"body-text\"><strong>Disclosure</strong>&nbsp;&ndash; Do complete specifications and tools for validating technical integrity exist, and are freely available (rather than company secrets)? Digital preservation requires an understanding of how the information is represented (encoded) as bits and bytes in digital files.</div>\n\t</li>\n</ul>\n\n<ul>\n\t<li>\n\t<div class=\"body-text\"><strong>Adoption</strong>&nbsp;by primary creators, disseminators and users of information resources. A widely used format is less likely to become (rapidly) obsolete. If it still becomes outdated at some stage, tools for migration of file formats or emulation of their soft- and hardware environment are more likely to emerge. It may however be hard to predict whether a format remains popular over many years.</div>\n\t</li>\n\t<li>\n\t<div class=\"body-text\"><strong>Transparency</strong>&nbsp;&ndash; Are file formats open to direct analysis with basic tools? If the underlying information is represented simply and directly, it can be more easily migrated if need should arise.</div>\n\t</li>\n\t<li>\n\t<div class=\"body-text\"><strong>Self-documentation</strong>&nbsp;&ndash; Are metadata included within the file? Basic descriptive metadata are analogous to the title page of a book.</div>\n\t</li>\n\t<li>\n\t<div class=\"body-text\"><strong>(Limited) external dependencies</strong>&nbsp;&ndash; degree to which a format depends on specific hardware, software or operating systems and predicted complexity of dealing with such requirements in future technical environments.</div>\n\t</li>\n\t<li>\n\t<div class=\"body-text\"><strong>Impact of patents</strong>&nbsp;&ndash; This depends on terms chosen by patent holders, widespread adoption of a format may indicate that patents do not pose problems for long-term archiving.</div>\n\t</li>\n\t<li>\n\t<div class=\"body-text\"><strong>Technical protection mechanisms</strong>&nbsp;such as encryption pose problems for long-term archival and dissemination, migration to new formats, transfer to new storage media, &hellip; .</div>\n\t</li>\n</ul>\n\n<p>&nbsp;</p>\n"}