{"key":"en.content.start.fileHandling","value":"<div class=\"headline-main\">File Handling</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\">How do you keep track of all files generated during a scientific project? How do you deal with changes that can occur during data processing and analysis, or while editing a text document (e.g. report)? When several people are involved in a project it is highly recommended to define practices&nbsp;prior to the start of a project, and observe such practices throughout the research process. <strong>File names</strong> <strong>should be descriptive</strong>, providing useful cues to content of a file independent of its location on a computer. Besides, a <strong>sophisticated folder structure</strong> might also help you rediscover your project contents. Finally, keeping track of <strong>different versions of your files</strong> facilitates recovery in cases of data loss due to unintended modifications.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">File Nomenclature</div>\n\n<div class=\"body-text\">Here are some recommendations how to name your files:</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Good practice:</strong></div>\n\n<ul>\n\t<li>Include relevant information in file names. This may include project, investigator (initials), experiment, location, date, parameter, status of data (raw, processed etc.), file version, or anything else deemed relevant in a given context.</li>\n\t<li>Use YYYYMMDD / YYYY_MM_DD for dates (e.g. 20160802 / 2016_08_02) and put date at the beginning or end of file names, both to facilitate chronological sorting.</li>\n\t<li>Use leading zeros for other numbers as needed (001, 002, &hellip;. 011, &hellip;. 114 rather than 1, 2, &hellip;.. 11, &hellip;.. 114) depending on the expected amount of files, also to allow files to be properly sorted.</li>\n\t<li>Use dashes (file-name.xxx) or underscores (file_name.xxx) to separate parts of a filename.</li>\n\t<li>Generate a&nbsp;README file&nbsp;explaining file nomenclature (including the meaning of acronyms or abbreviations), file organization and versioning. Store this file on top of a folder structure for easy access.</li>\n\t<li>Decide to use either upper case or lower case letters; don&#39;t mix them.&nbsp;</li>\n</ul>\n\n<div class=\"body-text\"><strong>Better avoid to:</strong></div>\n\n<ul>\n\t<li>use special characters such as ~ ! / \\ @ # $ % ^ &amp; * ( ) ` ; &lt; &gt; ? , [ ] { } &lsquo; &ldquo;| as they may have specific meanings in certain operating environments. Also avoid &auml; &ouml; &uuml; &szlig; &aring; &oslash; &ntilde; or similar.</li>\n\t<li>use dots other than before the file extension.</li>\n\t<li>use spaces in file names &ndash; they might end up being truncated during file transfer (with the file extension also lost and files potentially becoming unreadable).</li>\n\t<li>make file names overly long (a maximum of 32 characters is suggested) &ndash; this may involve compromises regarding the recommendation above.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p><strong>Good example:</strong></p>\n\n<p>20140618_exp08_co2data_raw_v01.csv</p>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">File Organization Structure</div>\n\n<div class=\"body-text\">In general, for the naming of folders the same rules apply as for files.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Depending on the structure of your data and documentation you have to decide on <strong>how to arrange your files and folders</strong>. This may also require judgement and compromises: a very deep folder structure (subsubsubsubsubfolders) can be as inconvenient as one folder with 100 or more individual files.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">If different project members should have various <strong>access restrictions to files</strong> this could be represented by your folder structure.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">File Versioning</div>\n\n<div class=\"body-text\">Documents may evolve over time, several people may be involved in sequential changes. For data (of any kind, e.g. numeric or images) and text documents alike, file versioning serves two purposes:</div>\n\n<ul>\n\t<li>You can revert to earlier versions if needed.</li>\n\t<li>You can keep track of changes, including documentation on the underlying rationale and people involved.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Version control can be done either manually by using naming conventions or by using a <strong>version control system</strong>.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">When working manually, versions should be numbered consecutively; major changes (v1, v2, v3, &hellip;) can be distinguished from minor ones (v1-1, v1-2, v1-3 or 1a, 1b, 1c). Use leading zeros if you expect more than nine versions.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">However, do not apply such numbering when using version control software, as it will interfere with automatic versioning.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Qualifiers such as &ldquo;raw&rdquo; or &ldquo;processed&rdquo; for data, or &ldquo;draft&rdquo; or &ldquo;internal&rdquo; for documents are fine. So is &ldquo;final&rdquo; but don&rsquo;t use confusing terms such as &quot;final2&quot;, &quot;final-revised&quot;, &quot;final-changed_again&quot;, &quot;final_really&quot;. In other words: Assign &ldquo;final&rdquo; only when you are sure that no further changes will occur.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Additionally, further versioning information can be documented:</div>\n\n<ul>\n\t<li class=\"body-text\">What has changed and why?</li>\n\t<li class=\"body-text\">How were changes implemented (e.g. data processing steps)?</li>\n\t<li>Who was involved and/or responsible?</li>\n</ul>\n\n<div class=\"body-text\">Such information may be included within the documents or provided separately as a change log file.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Further Reading</div>\n\n<div class=\"body-text\">Stanford Libraries&nbsp;<span class=\"body-link\"><a href=\"https://library.stanford.edu/research/data-management-services/data-best-practices/best-practices-file-naming\" rel=\"noreferrer noopener\" target=\"_blank\">Best Practices for File Naming</a></span></div>\n\n<div class=\"body-headline\">&nbsp;</div>\n\n<p>&nbsp;</p>\n"}