{"key":"en.content.finalize.overview","value":"<div class=\"headline-main\">After research</div>\n\n<div class=\"headline-sub\">Share your data for lasting (extra) impact</div>\n\n<div class=\"body-text\">Data have potential value beyond their initial intent &ndash; verification of interpretations, new analysis methods, new insights based on comparison and/or combination with other data. They therefore need to be preserved and archived beyond the lifetime of a scientific project. Funding organizations generally require that data are kept for ten years &ndash; see e.g.&nbsp;<span class=\"body-link\"><a href=\"https://www.mpg.de/197494/rulesScientificPractice.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Rules of Good Scientific Practice</a></span>&nbsp;of the Max Planck Society and&nbsp;<span class=\"body-link\"><a href=\"https://www.dfg.de/download/pdf/foerderung/rechtliche_rahmenbedingungen/gute_wissenschaftliche_praxis/kodex_gwp.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">Kodex &ldquo;Leitlinien zur Sicherung guter wissenschaftlicher Praxis&rdquo;</a>&nbsp;</span>(Deutsche Forschungsgemeinschaft).</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">If not done earlier, data should &ndash; as much as possible &ndash; be converted to open and sustainable formats at this stage.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Data sharing</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"blue body-text info-box\">You may wish to make your data freely available after conclusion of a scientific project. This could include data that did not answer your research question, but might prove useful in the future for other (unanticipated) research questions. It could also include &quot;negative results&quot;.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">For data supporting scientific publications, data sharing is often required by publishers. Yet in some cases, e.g. personal data or commercially sensitive data, data cannot be (freely) shared &ndash; <strong>&ldquo;as open as possible, as closed as needed&rdquo;</strong>. If work on data continues beyond the lifetime of a project, data can be deposited and put under embargo. Data licences clarify how data can be re-used, and should thus always be provided.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">The preferred way of sharing data is deposition in a&nbsp;<strong>repository&nbsp;</strong>or data archive (see below). Sharing data solely via a project, departmental or personal homepage is unlikely to comply with funder and publisher expectations regarding long-term preservation, as these resources aren&rsquo;t necessarily sustainable. Supplementary material attached to a journal article is a &lsquo;traditional&rsquo; way of sharing data &ndash; but data may be (like the article itself) behind a paywall, and this option may offer limited flexibility about formats and may not be suitable for large datasets.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-headline\">Data journals<strong>&nbsp;</strong></div>\n\n<div class=\"body-text\">are a relatively recent option for describing and documenting data, with such outputs being peer-reviewed and receiving a status comparable to conventional scientific manuscripts. Scientific context will be provided without detailed interpretation of data. Data themselves are generally deposited in a repository and linked from the data paper. Some data journals also accept articles describing data services or best practices in data sharing.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><span class=\"body-link\"><a href=\"https://www.cms.hu-berlin.de/de/dl/dataman/teilen/dokumentation/datajournal/datajournal\" rel=\"noreferrer noopener\" target=\"_blank\">List of data journals (HU Berlin)</a></span></div>\n"}