{"key":"en.content.running.overview","value":"<div class=\"headline-main\">During research</div>\n\n<div class=\"headline-sub\">Safety first!</div>\n\n<div class=\"body-text\">The main data management task during the research process is to&nbsp;<strong>store data safely as they are generated, with regular backups</strong>. At this stage, data are generally shared only within a research team. A team may include external partners (other groups/departments from the same institute, other Max Planck institutes and beyond the Max Planck Society).</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">Numerous&nbsp;<strong>MPDL tools/services</strong>&nbsp;are available to Max Planck researchers and &ndash; upon invitation &ndash; their external collaborators. Additional (more discipline-specific) ones may exist at individual institutes.</div>\n\n<div class=\"body-headline green px0\" style=\"text-align:center\"><span style=\"font-size:24px\">Tooools!</span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">Storing data&nbsp;<em>solely</em>&nbsp;on a local harddisk, laptop or USB stick is very risky and therefore not recommended. Storage media may deteriorate or could be lost, stolen, damaged or destroyed (e.g. during a fire). You might also delete data accidentally. A good rule of thumb is to store data three times, on two different media, with one copy off-site&nbsp;<strong>(3-2-1 rule)</strong>. Backups should be performed regularly &ndash; automatic backups are better than manual ones which you might forget. Also verify that backups are working, and that you have access to these files.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"blue body-text info-box\"><strong>See also:</strong>&nbsp;Perker, J.M., 2019: 11 ways to avert a data-storage disaster. Nature 568,&nbsp;<br />\n<a href=\"https://dx.doi.org/10.1038/d41586-019-01040-w\">doi:&nbsp;</a><a href=\"https://dx.doi.org/10.1038/d41586-019-01040-w\" rel=\"noreferrer noopener\" target=\"_blank\">10.1038/d41586-019-01040-w</a>.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Topics covered in the previous section may require ongoing attention: A data management plan needs to be followed, and may have to be updated while research is ongoing. Sensitive personal data obviously require special care throughout the research process.</div>\n\n<p>&nbsp;</p>\n"}