{"key":"en.content.legal.privacy","value":"<div class=\"headline-main\">Datenschutzhinweis</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\">\n<div class=\"body-headline\">Datenerhebung und Datenverarbeitung</div>\n\n<p>Die MPDL legt gro&szlig;en Wert den Schutz und die Sicherheit personenbezogener Daten. Dabei richten wir uns nach den entsprechenden Vorgaben des Bundesdatenschutzgesetzes (BDSG) sowie der EU-Datenschutz-Grundverordnung (DSGV).</p>\n\n<p>Auf dieser Seite erhalten Sie genaue Informationen dazu, welche Arten von Daten zu welchen Zwecken erfasst und verarbeitet werden.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Umfang der Datenverarbeitung</div>\n\n<p>Wir erheben und verwenden personenbezogene Nutzerdaten grunds&auml;tzlich nur, soweit dies zur Bereitstellung einer funktionsf&auml;higen Website sowie unserer Inhalte und Leistungen erforderlich ist. Die Erhebung und Verwendung personenbezogener Daten unserer Nutzer erfolgt regelm&auml;&szlig;ig nach Einwilligung der Nutzer. Eine Ausnahme gilt in solchen F&auml;llen, in denen die Verarbeitung der Daten durch gesetzliche Vorschriften gestattet ist.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Rechtsgrundlage der Datenverarbeitung</div>\n\n<p>Soweit wir f&uuml;r Verarbeitungsvorg&auml;nge personenbezogener Daten eine Einwilligung der betroffenen Person einholen, dient Art. 6 Abs. 1 lit. a EU-Datenschutzgrundverordnung (DSGVO) als Rechtsgrundlage.</p>\n\n<p>Bei der Verarbeitung von personenbezogenen Daten, die zur Erf&uuml;llung eines Vertrages, dessen Vertragspartei die betroffene Person ist, erforderlich ist, dient Art. 6 Abs. 1 lit. b DSGVO als Rechtsgrundlage. Dies gilt auch f&uuml;r Verarbeitungsvorg&auml;nge, die zur Durchf&uuml;hrung vorvertraglicher Ma&szlig;nahmen erforderlich sind.</p>\n\n<p>Ist die Verarbeitung zur Wahrung eines berechtigten Interesses der MPG oder eines Dritten erforderlich und &uuml;berwiegen die Interessen, Grundrechte und Grundfreiheiten des Betroffenen das erstgenannte Interesse nicht, so dient Art. 6 Abs. 1 lit. f DSGVO als Rechtsgrundlage f&uuml;r die Verarbeitung.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Auskunft, Berichtigung, L&ouml;schung und Sperrung, Widerspruchsrecht</div>\n\n<p>Sie sind gem&auml;&szlig; &sect; 34 BDSG (Art. 15 DSGVO) jederzeit berechtigt, gegen&uuml;ber der MPDL um umfangreiche Auskunftserteilung zu den zu Ihrer Person gespeicherten Daten zu ersuchen.</p>\n\n<p>Ebenso k&ouml;nnen Sie Gem&auml;&szlig; &sect; 35 BDSG jederzeit gegen&uuml;ber der MPDL die Berichtigung (Art. 16 DSGVO), L&ouml;schung (Art. 17 DSGVO) und Sperrung (Art. 18 DSGVO) einzelner personenbezogener Daten verlangen.</p>\n\n<p>Sie haben dar&uuml;ber hinaus das Recht, gem&auml;&szlig; Art. 21 DSGVO Widerspruch gegen die Verarbeitung Ihrer personenbezogenen Daten einzulegen, soweit daf&uuml;r Gr&uuml;nde vorliegen, die sich aus Ihrer besonderen Situation ergeben.</p>\n\n<p>Sie k&ouml;nnen den Widerspruch entweder postalisch, per E-Mail oder per Fax an die MPDL &uuml;bermitteln.</p>\n\n<p>Sie haben das Recht, sich bei der zust&auml;ndigen Aufsichtsbeh&ouml;rde zu beschweren (Art. 77 DSGVO). Dies ist f&uuml;r die MPG das Bayerische Landesamt f&uuml;r Datenschutzaufsicht, Postfach 606, 91511 Ansbach.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Protokolldateien (Logs)</div>\n\n<p>Aus technischen Gr&uuml;nden speichern unsere Server bei Ihrem Zugriff auf Max Planck Digital Library personenbezogene Verbindungsdetails in ihren Protokolldateien, den sogenannten Logfiles.</p>\n\n<p>Folgende Daten werden vor&uuml;bergehend gespeichert:</p>\n\n<ul>\n\t<li>Ihre IP-Adresse</li>\n\t<li>Datum und Uhrzeit Ihres Zugriffs auf die Seite</li>\n\t<li>Adresse der aufgerufenen Seite</li>\n\t<li>Adresse der zuvor besuchten Webseite (Referrer)</li>\n\t<li>Name und Version Ihres Browsers/Betriebssystems (sofern &uuml;bertragen)</li>\n</ul>\n\n<p>Die Erfassung der Daten zur Bereitstellung der Website und die Speicherung der Daten in Logfiles ist f&uuml;r den Betrieb der Webseite zwingend erforderlich. Diese Daten werden lediglich zur unmittelbaren Bereitstellung unserer Dienste, zur St&ouml;rungsbeseitigung oder zur Abwehr eines Angriffs genutzt und nach kurzer Zeit automatisch gel&ouml;scht.</p>\n\n<p>Rechtsgrundlage f&uuml;r die vor&uuml;bergehende Speicherung der Daten und der Logfiles ist Art. 6 Abs. 1 f) DSGVO. Die Speicherung in Logfiles erfolgt, um die Funktionsf&auml;higkeit der Website sicherzustellen. Zudem dienen uns die Daten zur Optimierung der Webseiten, zur St&ouml;rungsbeseitigung und zur Sicherstellung der Sicherheit unserer informationstechnischen Systeme. In diesen Zwecken liegt auch unser berechtigtes Interesse an der Datenverarbeitung</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Cookies</div>\n\n<p>Um Ihnen die Nutzung unserer Webseite zu erleichtern, verwenden wir sog. &quot;Session-Cookies&quot;. Dabei handelt es sich um kleine Textdateien, die nur f&uuml;r die Dauer Ihres Besuchs unserer Webseite auf Ihrer Festplatte hinterlegt und abh&auml;ngig von der Einstellung Ihres Browser-Programms beim Beenden des Browsers wieder gel&ouml;scht werden. Diese Cookies rufen keine auf Ihrer Festplatte &uuml;ber Sie gespeicherten Informationen ab und beeintr&auml;chtigen nicht Ihren PC oder ihre Dateien.</p>\n\n<p>Die meisten Browser sind so eingestellt, dass sie Cookies automatisch akzeptieren. Sie k&ouml;nnen das Speichern von Cookies jedoch deaktivieren oder ihren Browser so einstellen, dass er Sie auf die Sendung von Cookies hinweist.</p>\n\n<p>Bitte beachten Sie, dass einzelne Funktionen unserer Website beeintr&auml;chtigt werden k&ouml;nnten, wenn Sie die Verwendung von Cookies deaktiviert haben.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Webanalyse</div>\n\n<p>Wir setzen zur statistischen Datenerfassung des Nutzungsverhaltens das Webanalytik-Programm Matomo (ehemals Piwik) ein, das mit Cookies und JavaScript verschiedene Informationen auf Ihrem Computer sammelt und automatisiert an uns &uuml;bertr&auml;gt. Bei jedem Aufruf unserer Webseiten erfasst unser System folgende Daten und Informationen vom Computersystem des aufrufenden Rechners:</p>\n\n<ul>\n\t<li>IP-Adresse, durch Verk&uuml;rzen anonymisiert</li>\n\t<li>Zwei Cookies zur Unterscheidung verschiedener Besucher (pk_id und pk_sess)</li>\n\t<li>Zuvor besuchte URL (Referrer), sofern vom Browser &uuml;bermittelt</li>\n\t<li>Name und Version des Betriebssystems</li>\n\t<li>Name, Version und Spracheinstellung des Browsers</li>\n</ul>\n\n<p>Zus&auml;tzlich, sofern JavaScript aktiviert ist:</p>\n\n<ul>\n\t<li>Besuchte URLs auf dieser Webseite</li>\n\t<li>Zeitpunkte der Seitenaufrufe</li>\n\t<li>Art der HTML-Anfragen</li>\n\t<li>Bildschirmaufl&ouml;sung und Farbtiefe</li>\n\t<li>Vom Browser unterst&uuml;tzte Techniken und Formate (z. B. Cookies, Java, Flash, PDF, WindowsMedia, QuickTime, Realplayer, Director, SilverLight, Google Gears)</li>\n</ul>\n\n<p>Die Speicherung und Auswertung der Daten erfolgt ausschlie&szlig;lich auf einem zentralen Server, der von der MPG betrieben wird. Neben der zentralen Webseite www.mpg.de wird es auch von den meisten Max-Planck-Instituten und vielen der MPG zugeordneten Projekt-Webseiten genutzt.</p>\n\n<p>Rechtsgrundlage f&uuml;r die Verarbeitung der personenbezogenen Daten der Nutzer ist Art. 6 Abs. 1 lit. f DSGVO. Die Verarbeitung der personenbezogenen Daten der Nutzer erm&ouml;glicht uns eine Analyse des Nutzungsverhaltens unserer Nutzer. Wir sind durch die Auswertung der gewonnenen Daten in der Lage, Informationen &uuml;ber die Nutzung der einzelnen Komponenten unserer Webseiten zusammenzustellen. Dies hilft uns dabei unsere Webseiten und deren Nutzerfreundlichkeit stetig zu verbessern. In diesen Zwecken liegt auch unser berechtigtes Interesse in der Verarbeitung der Daten nach Art. 6 Abs. 1 lit. f DSGVO. Durch die Anonymisierung der IP-Adresse wird dem Interesse der Nutzer an deren Schutz personenbezogener Daten hinreichend Rechnung getragen.</p>\n\n<p>Die Daten werden nach der Bildung der abschlie&szlig;enden Jahressummen f&uuml;r die Zugriffsstatistik gel&ouml;scht.</p>\n\n<p>Selbstverst&auml;ndlich haben Sie die M&ouml;glichkeit der Datenerhebung zu widersprechen. Sie haben folgende unabh&auml;ngige M&ouml;glichkeiten einer Datenerfassung durch den zentralen Server zu widersprechen:</p>\n\n<ol>\n\t<li>Aktivieren Sie in Ihrem Browser die Einstellung Do-Not-Track bzw. Nicht folgen. Solange diese Einstellung aktiv ist, wird unser zentraler Matomo-Server keinerlei Daten von Ihnen speichern. Wichtig: Die Do-Not-Track-Anweisung gilt in der Regel nur f&uuml;r das eine Ger&auml;t und den einen Browser, in dem Sie die Einstellung aktivieren. Sollten Sie mehrere Ger&auml;te/Browser nutzen, dann m&uuml;ssen Sie Do-Not-Track&uuml;berall separat aktivieren.</li>\n\t<li>Nutzen Sie unsere Opt-Out-Funktion: In der&nbsp;<a href=\"http://colab.mpdl.mpg.de/mediawiki/Erkl%C3%A4rung_zur_Datenerhebung\" rel=\"noopener\" target=\"_blank\">Erkl&auml;rung zur Datenerhebung</a><strong>.</strong></li>\n</ol>\n\n<p>Die Speicherung und Auswertung erfolgt grunds&auml;tzlich anonymisiert. Session-Cookies werden sp&auml;testens mit dem Schlie&szlig;en Ihres Browsers gel&ouml;scht.</p>\n\n<p>Personenbezogene Nutzerprofile werden nicht erstellt.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Externe Dienste</div>\n\n<p>Auch die Einbindung von externen Diensten, wie beispielsweise Google Maps oder Open Street Map f&uuml;r Anfahrtsbeschreibungen, Youtube bzw. Amazon Cloud f&uuml;r Videos erfolgen stets &uuml;berlegt und mit dem Ziel, den Besuch auf unseren Webseiten f&uuml;r Sie so angenehm wie m&ouml;glich zu gestalten.</p>\n\n<p>Wir m&uuml;ssen Sie aber darauf hinweisen, dass auf diesem Weg Ihre IP-Adresse und m&ouml;glicherweise weitere personenbezogenen Daten an den jeweiligen Dienstleister (Google, Amazon, etc.) &uuml;bertragen und eventuell gespeichert und ausgewertet werden.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Daten&uuml;bermittlung</div>\n\n<p>Ihre personenbezogenen Daten werden nur in den gesetzlich erforderlichen F&auml;llen bzw. zur Strafverfolgung aufgrund von Angriffen auf unsere Netzinfrastruktur an staatliche Einrichtungen und Beh&ouml;rden &uuml;bermittelt. Eine Weitergabe zu anderen Zwecken an Dritte findet nicht statt.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">&Auml;nderungen der Datenschutzbestimmungen</div>\n\n<p>Diese Datenschutzerkl&auml;rung kann ggf. im Laufe der Zeit angepasst werden, weil sich die rechtlichen Rahmenbedingungen ge&auml;ndert haben oder weil neue Funktionalit&auml;ten oder Services dies erfordern.</p>\n\n<p>Mit der Nutzung der Webseite erkl&auml;ren Sie sich mit den ge&auml;nderten Bedingungen dieser Richtlinien zum Schutz pers&ouml;nlicher Daten einverstanden.</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Fragen an die Datenschutzbeauftragte</div>\n\n<p>F&uuml;r Fragen zum Thema Datenschutz steht Ihnen die Datenschutzbeauftragte der Max-Planck-Gesellschaft per E-Mail an&nbsp;<a href=\"mailto:datenschutz@mpg.de\" target=\"_blank\">datenschutz[at]mpg.de</a>&nbsp;oder telefonisch unter +49 89 2108-1554 zur Verf&uuml;gung.</p>\n</div>\n"}