{"key":"en.content.running.services","value":"<div class=\"headline-main\">MPDL Services for researchers</div>\n\n<div class=\"headline-sub\">We are here to help you!&nbsp;</div>\n\n<div class=\"body-text\">MPDL services help researchers during data acquisition, safe data storage and collaborative working on data as they are generated. Services for finalized datasets (long-term archival and, if applicable, open sharing of research data) will be <a href=\"#/finalize/services\" target=\"_blank\">mentioned</a> in the &quot;After research&quot; chapter.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">All services are available to Max Planck researchers and - upon invitation - their external collaboration partners.&nbsp;<strong>Your data will stay within the Max Planck Society.</strong></div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">\n<div class=\"body-headline\">Data acquisition tools</div>\n\n<p><span class=\"body-link\"><a href=\"#/tools/labfolder\">labfolder</a></span></p>\n\n<p><span class=\"body-link\"><a href=\"#/tools/labcam\">LabCam</a></span></p>\n\n<div class=\"body-headline\">Tools for data storage and collaborative working</div>\n\n<p><span class=\"body-link\"><a href=\"#/tools/keeper\">Keeper</a></span></p>\n\n<p><span class=\"body-link\"><a href=\"#/tools/collective\">&laquo;collective&raquo;</a></span></p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"headline-sub\">Electronic laboratory notebook advice</div>\n\n<div class=\"body-text\">Thorough documentation of experimental procedures (sample preparation, instrument settings, calibration, quality control, &hellip;) for data acquisition is essential to answer questions that can arise during later phases of the research process: data processing and synthesis, interpretation and writing up of results in scientific papers or Ph.D. thesis.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Traditionally-historically, such laboratory notes were taken on paper, which has several disadvantages:</div>\n\n<ul>\n\t<li>It is not possible to include information already present in digital form, namely most output of scientific instruments (all that can be done, and is done is paste/glue printouts).</li>\n\t<li>Your handwriting may be(come) illegible for others, or even for your future self.</li>\n\t<li>Paper notes cannot be accessed remotely.</li>\n\t<li>Major projects may require a series of labbooks.</li>\n\t<li>Paper notes aren&rsquo;t automatically searchable, thus retrieving details well after an experiment was conducted may be tedious and time-consuming &ndash; if at all possible.</li>\n\t<li>Paper notes cannot be easily edited &ndash; no options such as Copy, Paste, Delete or Insert (text).</li>\n\t<li>It isn&rsquo;t possible to create and use templates for recurrent processes.</li>\n\t<li>Paper notes have limited if any options for contributions by multiple group members.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p><img alt=\"\" src=\"/media/en/content/running/services/mPad-Labor-520x346.jpg\" style=\"width:100%\" /></p>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Electronic laboratory notebooks&nbsp;(ELNs) offer far more flexibility, structure to data and digital preservation potential. Various ELN solutions have different features that may be particularly suitable for certain scientific fields or analytical methods &ndash; MPDL can make suggestions after discussing your specific needs.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">labfolder is the ELN solution licensed for all Max Planck researchers and their project partners.</div>\n\n<p>&nbsp;</p>\n</div>\n"}