{"key":"en.content.legal.terms","value":"<div class=\"headline-main\">Terms of Service of the Max Planck Digital Library</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\">General</div>\n\n<div class=\"body-text\">General Terms of Service apply to services provided by Max Planck Digital Library (MPDL) on behalf of Max Planck Society. Please be aware that enhanced Terms of Services may take effect for specific services. Please check the particular service websites for further information.</div>\n\n<div class=\"body-text\">By using a service of the MPDL, users enter into a binding agreement to accept the Terms of Service described herein and agree to be bound by them. Users who do not agree to these Terms of Service please refrain from using services of the MPDL.</div>\n\n<div class=\"body-text\">Users represent that they have the legal authority to accept these Terms.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Registration</div>\n\n<div class=\"body-text\">Uploading content to MPDL services may require user&rsquo;s registration. By registering, user agrees to only provide true and accurate information about herself. Personal data that is entered in the registration process is used only for authorization purposes and will not be given to third parties unless required by law.</div>\n\n<div class=\"body-text\">User access may be revoked on violation of the Terms of Service.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">User&acute;s Warranty</div>\n\n<div class=\"body-text\">If a user uploads content into a Max Planck Digital Libraries service, she warrants that\n<ul>\n\t<li>content provided by her and made available through the service does not violate or infringe the rights of any third party, including copyright, trademark, privacy, publicity or other personal or proprietary rights</li>\n\t<li>she owns or otherwise controls all rights required for submitting the content to a specific service</li>\n</ul>\n\n<p>If a user publishes content through a Max Planck Digital Library service, she warrants that content is unencumbered by third-party rights and the relevant data protection provisions are respected. In particular, datasets that contain individual-level data (for example survey data) is anonymized in such a way that the identification of individuals is excluded (de facto anonymity).</p>\n\n<div class=\"distance px8\">&nbsp;</div>\n</div>\n\n<div class=\"body-headline\">General Conduct</div>\n\n<div class=\"body-text\">User shall not in any form</div>\n\n<ul>\n\t<li>interfere or attempt to interfere with the proper working of the sites and services or any related activity</li>\n\t<li>bypass any measures that may be used to prevent or restrict access to the sites or services</li>\n\t<li>run auto-responders or &ldquo;spam&rdquo; on the sites or services</li>\n\t<li>upload any illegal content, especially, but not limited to, any content, which can be deemed as extremist, racism and/or any sexual explicit content. Such illegal content is not protected by a possible confidentiality of the MPDL services and will be disclosed to the law enforcement authorities for further investigation</li>\n\t<li>upload any viruses or any code of destructive nature</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<ul>\n</ul>\n\n<div class=\"body-headline\">Liability / Responsibility</div>\n\n<ul>\n\t<li>User bears the sole responsibility for its activity in connection with the service.</li>\n\t<li>MPDL does not make any warranties about content made accessible through a service. Under no circumstances is MPDL responsible or liable in any way for any content, including but not limited to: its accuracy, copyright compliance, legality or decency, completeness, or for any loss or damage of any kind incurred as a result of the use of any content made available via the services.</li>\n\t<li>User releases MPDL from all liability in connection with the acquisition of content through the services.</li>\n\t<li>User is liable for damage arising from third-party use in connection with the privileges of access and use accorded to her if she approves such third-party use, particularly in the event of divulging her user identification and password to third parties.</li>\n\t<li>User shall exonerate MPDL from all claims if any such are made on MPDL by third parties because of the user&#39;s improper or unlawful conduct to obtain damages, or restraining orders, or for any other purpose. MPDL will explain the dispute to the user insofar as third parties take legal action against MPDL.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<ul>\n</ul>\n\n<div class=\"body-headline\">Operation</div>\n\n<div class=\"body-text\">No warranty is given that</div>\n\n<ul>\n\t<li>Services will be secure and operate without fault and at all times without interruption. Possible data losses due to technical defects and divulging of confidential data through unauthorized access by third parties cannot be ruled out.</li>\n\t<li>Defects or errors will be corrected</li>\n\t<li>Using a service will meet specific requirements</li>\n\t<li>Submissions are free of viruses or other harmful components</li>\n</ul>\n\n<div class=\"body-text\">Use of service is solely at user&rsquo;s risk.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Indemnification</div>\n\n<div class=\"body-text\">To the extent authorized by law, user agrees to indemnify and hold harmless MPDL services from and against any and all claims arising out of users&#39;s violation of the terms.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Miscellaneous</div>\n\n<div class=\"body-text\">This Terms of Service agreement shall be construed, governed, interpreted and applied in accordance with the laws of the Federal Republic of Germany.</div>\n\n<div class=\"body-text\">Any dispute or claim arising out of or relating to this agreement shall be settled by good faith negotiations within a reasonable period. If the parties are unable to settle claims or controversies under this agreement, the enforcement or interpretation hereof, or any alleged breach or default under the provisions hereof, such claims or controversies shall exclusively be settled by the court competent for the registered office of the Max Planck Society.</div>\n"}