{"key":"en.content.start.pdfFormat","value":"<div class=\"headline-main\">Notes on PDF Format</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\">The PDF format<strong> conserves layout rather than structured content</strong>. It is widely adopted and well-suited for <strong>dissemination</strong>, but has limitations for archival and digital preservation. This primarily refers to <strong>automated metadata extraction</strong> (even basic bibliographic elements) with machine-based technology.</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">The purpose of this section is to describe the PDF format and its limitations, and to offer (partial) solutions for archival purposes.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">General Description of PDF Format</div>\n\n<div class=\"body-text\">PDF has become a de facto format for exchange of&nbsp;<strong>print-oriented documents</strong>, ensuring&nbsp;robust visual presentation across a variety of operating systems and platforms&nbsp;and preserving the author&rsquo;s intent in finalized form. It was partly designed for the Internet and is thus well-suited for documents available on-line.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">While proprietary in origin, it is now part of a family of&nbsp;<strong>ISO standards</strong>. In 2008, control of specifications was passed to an ISO committee of voluntary industry experts (including, but not limited to Adobe Inc.). Adobe Reader is freely available (no definite guarantee that this will always be the case), third parties can develop PDF tools.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">PDF files most commonly contain text, graphic paths and/or images and may also incorporate e.g. video/audio and hyperlinks to external content. They become <strong>incompatible with source files</strong>: The initial image format is not conserved, and it is difficult to convert PDF files back into editable formats like Microsoft Word &ndash; paragraphs, formatting, line breaks etc. are not preserved.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">PDF/A for Archival Purposes and Tagged PDF</div>\n\n<div class=\"body-text\">The <strong>PDF/A format is designed to be&nbsp;self-contained</strong>&nbsp;without external dependencies:&nbsp;Fonts have to be embedded&nbsp;(rather than linked), device-independent color information has to be provided. Forbidden content includes audio, video, JavaScript and executable file launches. However, annotations such as hyperlinks are allowed. PDF/A preserves additional information in documents beyond what is needed for printing.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Tagged PDF&nbsp;provides markup for real conten</strong>t (structure of documents) while ignoring artifacts such as page numbers. The aim is to embed logical structure for accessibility and repurposing of content.</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Challenges in Automated Metadata Extraction</div>\n\n<div class=\"body-text\">As the PDF format conserves layout and design rather than logical document structure, automated extraction of even basic bibliographic metadata (e.g. title, publisher, authors, affiliations) is challenging. Humans can recognize the format of text from layout and overcome inconsistencies and vagueness from different layouts used by different publishers, but machine-based technology cannot.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Numerous automated tools exist, using different approaches aiming for bulk processing without user interaction, high accuracy and high adaptivity (to diverse formatting layouts). But all tools are error-prone.<strong> </strong>Ideally, metadata are stored within a PDF file &ndash; but this is rarely the case, hence full text has to be analyzed.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Additional challenges are</div>\n\n<ul>\n\t<li>scanned documents (rather than born digital), requiring OCR (optical character recognition) for processing of text content.</li>\n\t<li>badly formed PDFs (created by a multitude of software tools). Adobe Reader has a high tolerance for rendering invalid PDF files.</li>\n\t<li>the multitude of different PDF versions over the years.</li>\n</ul>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Recommendations</div>\n\n<ul>\n\t<li><strong>Provide PDF files in PDF/A format and as tagged PDF</strong>. Both has to be intentionally selected (Save as PDF -&gt; Options). Note that an existing generic PDF file cannot be sensibly converted to PDF/A because relevant information has been lost during conversion of a source file to PDF.</li>\n\t<li><strong>Provide metadata within a PDF file</strong>. Ideally this should be done in a standardized way.</li>\n\t<li>If possible, <strong>provide the original format(s) and/or a machine-readable forma</strong>t (e.g. XML) along with a PDF file.</li>\n</ul>\n\n<div class=\"distance px12\">&nbsp;</div>\n\n<div class=\"body-headline\" style=\"text-align:center\">Further Reading</div>\n\n<p><span class=\"body-link\"><a href=\"https://www.loc.gov/preservation/digital/formats/fdd/fdd000318.shtml\">Library of Congress about PDF/A</a></span></p>\n\n<p>Klindt, M. (2017)<span class=\"body-link\"> <a href=\"https://ipres2017.jp/wp-content/uploads/15.pdf\">PDF/A considered harmful for digital preservation</a></span></p>\n\n<p>Fanning, B. A. (2017<span class=\"body-link\">) <a href=\"https://www.dpconline.org/docs/technology-watch-reports/1707-twr17-01-revised/file\">Preservation with PDF/A</a></span>. 2nd Edition. DPC Technology Watch Report&nbsp;</p>\n\n<div class=\"body-text\">&nbsp;</div>\n\n<div class=\"distance px12\">&nbsp;</div>\n"}