{"key":"en.content.structure.intro","value":"<div class=\"headline-main\">Overview</div>\n\n<div class=\"headline-sub\">Data management - do yourself and others a favor</div>\n\n<div class=\"body-text\">Digital data are the foundation of all scientific research. The increasing amount and complexity of scientific data &ndash; in terms of data types, file formats, file sizes and number of files &ndash; poses challenges to keep data organized and documented and to make them available for verification of research and new analyses leading to new insights.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">The&nbsp;<span class=\"body-link\"><a href=\"https://www.dfg.de/download/pdf/foerderung/rechtliche_rahmenbedingungen/gute_wissenschaftliche_praxis/kodex_gwp.pdf\" rel=\"noreferrer noopener\" target=\"_blank\">DFG Kodex &ldquo;Leitlinien zur Sicherung guter wissenschaftlicher Praxis&rdquo;</a></span>, applicable since August 2019, emphasizes the importance of documenting research (Leitlinie 12). It encourages scientists to make research data publicly available (Leitlinie 13) and to archive data for the long term (generally ten years, Leitlinie 17). In 2017, the&nbsp;<span class=\"body-link\"><a href=\"https://ec.europa.eu/programmes/horizon2020/en\" rel=\"noreferrer noopener\" target=\"_blank\">EU Framework Programme Horizon 2020</a></span>&nbsp;extended their Open Research Data Pilot to cover all thematic areas, making open access to research data the default option.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"blue body-text info-box\">Data management involves data organization and documentation, secure storage and in many cases open data sharing. The purpose of these pages is to provide data management guidance throughout the research process, introducing&nbsp;<strong>MPDL tools and services</strong>&nbsp;to help researchers of the Max Planck Society (and their collaboration partners).</div>\n\n<div class=\"distance px8\" style=\"text-align:center\">&nbsp;</div>\n\n<div class=\"body-headline green px0\" style=\"text-align:center\"><span style=\"font-size:24px\">Tooooools !!!</span></div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-headline\">Why data management?</div>\n\n<div class=\"body-text\">It is&nbsp;<strong>good scientific practice</strong>, ensuring that research can be verified and reproduced. Moreover, data can be re-used &ndash; on their own or combined with other data &ndash; including in ways not anticipated by initial data creators. This can also prevent duplication of research efforts.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"distance px4\">&nbsp;</div>\n\n<div class=\"body-text\">It is increasingly&nbsp;<strong>required by funding agencies and publishers</strong>. Funding agencies want outputs of publicly funded research to reach a wide audience. Publishers insist that data underlying scientific papers are made available.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Last but not least, it is&nbsp;<span style=\"color:#3498db\"><strong>in your own interest</strong></span>, for two reasons:</div>\n\n<ul>\n\t<li>You can get credit for sharing your data, it creates additional exposure for your research, may lead to new collaborations, &hellip;.. .</li>\n</ul>\n\n<ul>\n\t<li>It enables you to keep track of your own data and facilitates working together in research teams. Without efforts to organize and document your data, are you sure to find and understand them five years from now? Will your collaborators understand your data? You may end up being the&nbsp;<strong><em>first re-user of your own data</em></strong>. It may be necessary to re-analyze raw data upon request from e.g. your supervisor or journal reviewers, or even after publication if your interpretations and conclusions are questioned/challenged. <strong><span style=\"color:#e74c3c\">Data loss could happen for many reasons and at any inconvenient moment&nbsp;</span></strong>such as the final phase of a Ph.D. thesis.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Data management does not imply that&nbsp;<em>all</em>&nbsp;data have to be shared&nbsp;<em>immediately</em>. Data publication can be delayed until after publication of research findings; sensitive data might be shared with a limited audience and only under certain conditions, or not at all.</div>\n\n<div class=\"body-headline\">What are research data ?</div>\n\n<div class=\"body-text\">There is no straightforward definition applicable to all scientific fields &ndash; the broadest one would be &ldquo;<strong>anything needed to underpin scientific research</strong>&ldquo;, i.e. to validate and reproduce research findings. While physical samples may also be considered &ldquo;data&rdquo;, we here focus on digital (or digitized) objects.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Partly dependent on scientific field and research questions, data can be quantitative or qualitative, come in various formats, and are generated with a range of methods (e.g. field observations, experiments, model output, interviews/polls).&nbsp;<strong>Raw data</strong>&nbsp;are the initial primary results,&nbsp;<strong>processed data</strong>&nbsp;are the product of subsequent steps, e.g. data cleaning, quality control, data aggregation, statistical analysis.</div>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\"><strong>Tools</strong>&nbsp;used during such steps &ndash; code, scripts, software if not widely available &ndash; are also research data. Preserving, documenting and &ndash; to the extent possible &ndash; sharing your data processing workflow contributes to research reproducibility (by others or even by your future self) and is thus good scientific practice.</div>\n\n<div class=\"body-headline\">Metadata</div>\n\n<div class=\"body-text\">&ldquo;Data about data&rdquo; are equally relevant for discovery and understanding of scientific datasets. Depending on characteristics of dataset and intended audience, various levels of detail may be adequate. Metadata can cover the following aspects:</div>\n\n<ul>\n\t<li>bibliographic information (title, author, &hellip;)</li>\n\t<li>contextual information (subject, geographical location, temporal coverage, keywords, &hellip;)</li>\n\t<li>administrative aspects (date of creation, file type, access rights, &hellip;)</li>\n\t<li>technical metadata (file properties and file sizes, &hellip;)</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<div class=\"body-text\">Metadata can be contained in the file itself, in a separate Readme file, or on a landing page for datasets &ndash; preferred option for using search tools.</div>\n\n<ul>\n\t<li><span class=\"body-link\"><a href=\"https://dublincore.org/\" target=\"_blank\">Dublin Core</a></span>&nbsp;is a widely used generic metadata standard.</li>\n</ul>\n\n<div class=\"distance px8\">&nbsp;</div>\n\n<p>For discipline-specific standards, see</p>\n\n<ul>\n\t<li>Data Curation Centre&nbsp;<span class=\"body-link\"><a href=\"http://www.dcc.ac.uk/resources/metadata-standards/list\">List of Metadata Standards</a></span></li>\n</ul>\n\n<ul>\n\t<li>Research Data Alliance&rsquo;s&nbsp;<span class=\"body-link\"><a href=\"http://rd-alliance.github.io/metadata-directory/\">Metadata Standards Directory</a></span></li>\n</ul>\n"}